digistump/OakCore/boards.txt
#menu.UploadSpeed=Upload Speed
menu.CpuFrequency=CPU Frequency
menu.FlashSize=Flash Size
#menu.FlashMode=Flash Mode
#menu.FlashFreq=Flash Frequency
menu.UploadTool=Upload Using
menu.RomConfig=ROM Config
#menu.ResetMethod=Reset Method

##############################################################
oak.name=Oak by Digistump

oak.upload.tool=oak_ota
oak.upload.speed=115200
oak.upload.resetmethod=ck
oak.upload.maximum_size=1040368
oak.upload.maximum_data_size=81920
oak.upload.wait_for_upload_port=false
oak.serial.disableDTR=true
oak.serial.disableRTS=true

oak.build.mcu=esp8266
oak.build.f_cpu=80000000L
oak.build.board=ESP8266_OAK
oak.build.core=oak
oak.build.variant=oak
oak.build.flash_mode=qio
oak.build.flash_freq=40
oak.build.spiffs_pagesize=256


oak.menu.CpuFrequency.80=80 MHz
oak.menu.CpuFrequency.80.build.f_cpu=80000000L
oak.menu.CpuFrequency.160=160 MHz
oak.menu.CpuFrequency.160.build.f_cpu=160000000L

oak.menu.UploadTool.oak_ota=Particle OTA
oak.menu.UploadTool.oak_ota.upload.tool=oak_ota
oak.menu.UploadTool.oak_ota.upload.verbose=-vv
oak.menu.UploadTool.esptool_py=Serial (Expert Use Only - Requires Python)
oak.menu.UploadTool.esptool_py.upload.tool=esptool_py
oak.menu.UploadTool.esptool_py.upload.verbose=-vv

oak.menu.FlashSize.OAK=OAK (4M/1M SPIFFS)
#this is in megabits - only needed for serial upload
oak.menu.FlashSize.OAK.build.flash_size=32m
oak.menu.FlashSize.OAK.build.spiffs_start=0x300000
oak.menu.FlashSize.OAK.build.spiffs_end=0x3FB000
oak.menu.FlashSize.OAK.build.spiffs_blocksize=8192
oak.menu.FlashSize.OAK.build.spiffs_pagesize=256

oak.menu.RomConfig.Full=Single - 1MB (Fullsize)
oak.menu.RomConfig.Full.build.flash_ld=oak_full.ld
oak.menu.RomConfig.Full.upload.maximum_size=1040368
oak.menu.RomConfig.Full.upload.flash_address=0x0002000

#oak.menu.RomConfig.Half1=First Half - 512KB (Half)
#oak.menu.RomConfig.Half1.build.flash_ld=oak_half1.ld
#oak.menu.RomConfig.Half1.upload.maximum_size=520176
#oak.menu.RomConfig.Half1.upload.flash_address=0x0002000

#oak.menu.RomConfig.Half2=Second Half - 512KB (Half)
#oak.menu.RomConfig.Half2.build.flash_ld=oak_half2.ld
#oak.menu.RomConfig.Half2.upload.maximum_size=520176
#oak.menu.RomConfig.Half2.upload.flash_address=0x0081000